In [1]:
import pandas as pd
df = pd.read_csv("D:/Datasets/simple_data.csv")

In [2]:
df.head()

   sirano     isim  yas       meslek     sehir  aylik_gelir
0       1    Cemal   35         Isci    Ankara         3500
1       2    Ceyda   42        Memur   Kayseri         4200
2       3    Timur   30     Müzisyen  Istanbul         9000
3       4    Burcu   29  Pazarlamaci    Ankara         4200
4       5  Yasemin   23  Pazarlamaci     Bursa         4800

# Sıralalama (sort_values)

In [3]:
# aylik_gelir'e göre sıralama

In [4]:
df.sort_values("aylik_gelir").head()

    sirano   isim  yas       meslek    sehir  aylik_gelir
0        1  Cemal   35         Isci   Ankara         3500
12      13  Hakkı   33        Memur    Çorum         3750
1        2  Ceyda   42        Memur  Kayseri         4200
3        4  Burcu   29  Pazarlamaci   Ankara         4200
11      12  Harun   43      Tornacı   Ankara         4200

# Azalan sıralama

In [5]:
# Varsayılan olarak sıralama artan sıralamadır. Büyükten küçüğe 
# sıralamak istersek sort_values() içine ascending=False
# demeliyiz.

In [6]:
df.sort_values("aylik_gelir", ascending=False).head()

    sirano      isim  yas    meslek     sehir  aylik_gelir
8        9     Ahmet   33    Doktor    Ankara        18000
13      14   Gülizar   37    Doktor     İzmir        14250
7        8     Murat   31  Müzisyen  Istanbul        12000
9       10  Muhittin   46    Berber  Istanbul        12000
2        3     Timur   30  Müzisyen  Istanbul         9000

# Birden Fazla Sütun için Sıralama

In [9]:
df.sort_values(["aylik_gelir","yas"], ascending=[False,True]).head(10)

    sirano      isim  yas       meslek     sehir  aylik_gelir
8        9     Ahmet   33       Doktor    Ankara        18000
13      14   Gülizar   37       Doktor     İzmir        14250
7        8     Murat   31     Müzisyen  Istanbul        12000
9       10  Muhittin   46       Berber  Istanbul        12000
2        3     Timur   30     Müzisyen  Istanbul         9000
15      16    Gençay   46       Berber    Ankara         8800
16      16    Gençay   46       Berber    Ankara         8800
14      15    Şehmuz   41     Müzisyen    Ankara         8700
6        7     Dilek   29  Pazarlamaci  Istanbul         7300
4        5   Yasemin   23  Pazarlamaci     Bursa         4800

In [ ]:
# 12.000 ve 8.800 gelirli olanların yaşlarına dikkat ediniz

# Filtreleme

In [7]:
# Mesleği doktor olanlar
# df[filtelemeyi sağlayacak koşul(lar)]

In [5]:
# Mesleği doktor olanlar
df[df.meslek == 'Doktor']

    sirano     isim  yas  meslek   sehir  aylik_gelir
8        9    Ahmet   33  Doktor  Ankara        18000
13      14  Gülizar   37  Doktor   İzmir        14250

In [7]:
# Mesleği Müzisyen olanlar ve aylik_gelir 10000'den büyük olanlar
df[(df["meslek"] == "Müzisyen") & 
   (df["aylik_gelir"] > 10000)]

   sirano   isim  yas    meslek     sehir  aylik_gelir
7       8  Murat   31  Müzisyen  Istanbul        12000

In [13]:
# Mesleği Doktor ya da Berber olanlar

In [8]:
df[(df["meslek"] == "Doktor") | 
   (df["meslek"] == "Berber")
  ]

    sirano      isim  yas  meslek     sehir  aylik_gelir
8        9     Ahmet   33  Doktor    Ankara        18000
9       10  Muhittin   46  Berber  Istanbul        12000
13      14   Gülizar   37  Doktor     İzmir        14250
15      16    Gençay   46  Berber    Ankara         8800
16      16    Gençay   46  Berber    Ankara         8800

# query() metodu ile sql where tarzı filtreleme

In [11]:
doc_or_berb = df.query(" meslek == 'Doktor' | meslek == 'Berber' ")
doc_or_berb.head()

    sirano      isim  yas  meslek     sehir  aylik_gelir
8        9     Ahmet   33  Doktor    Ankara        18000
9       10  Muhittin   46  Berber  Istanbul        12000
13      14   Gülizar   37  Doktor     İzmir        14250
15      16    Gençay   46  Berber    Ankara         8800
16      16    Gençay   46  Berber    Ankara         8800

In [12]:
gt_10000 = df.query(" aylik_gelir > 10000 ")
gt_10000.head()

    sirano      isim  yas    meslek     sehir  aylik_gelir
7        8     Murat   31  Müzisyen  Istanbul        12000
8        9     Ahmet   33    Doktor    Ankara        18000
9       10  Muhittin   46    Berber  Istanbul        12000
13      14   Gülizar   37    Doktor     İzmir        14250

# Filteleme ve Sıralamanın Birlikte Kullanımı

In [13]:
df[(df["meslek"] == "Doktor") | (df["meslek"] == "Berber") ].sort_values("aylik_gelir").head()

    sirano      isim  yas  meslek     sehir  aylik_gelir
15      16    Gençay   46  Berber    Ankara         8800
16      16    Gençay   46  Berber    Ankara         8800
9       10  Muhittin   46  Berber  Istanbul        12000
13      14   Gülizar   37  Doktor     İzmir        14250
8        9     Ahmet   33  Doktor    Ankara        18000

In [ ]:
# Önce filtreleme sonra sıralama

# unique() ile benzersiz kategorileri elde etme

In [9]:
df.meslek.unique()

array(['Isci', 'Memur', 'Müzisyen', 'Pazarlamaci', 'Doktor', 'Berber',
       'Tuhafiyeci', 'Tornacı'], dtype=object)

# distinct count

In [10]:
len(df.meslek.unique())

8

# Ödev

In [ ]:
# Advertising.csv veri seti üzerinde

# 1. Sales'e göre azalan sıralama
# 2. TV bütçesinin 50 den büyük olduğu kayıtlar

In [11]:
advertising = pd.read_csv("D:/Datasets/Advertising.csv")

In [12]:
advertising.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

In [13]:
# 1. Sales'e göre azalan sıralama

In [14]:
advertising.sort_values("Sales", ascending=False).head()

     Unnamed: 0     TV  Radio  Newspaper  Sales
175         176  276.9   48.9       41.8   27.0
183         184  287.6   43.0       71.8   26.2
198         199  283.6   42.0       66.2   25.5
98           99  289.7   42.3       51.2   25.4
147         148  243.2   49.0       44.3   25.4

In [15]:
# 2. TV bütçesinin 50 den büyük olduğu kayıtlar

In [17]:
advertising[ advertising.TV < 50 ].head(10)

    Unnamed: 0    TV  Radio  Newspaper  Sales
1            2  44.5   39.3       45.1   10.4
2            3  17.2   45.9       69.3    9.3
5            6   8.7   48.9       75.0    7.2
8            9   8.6    2.1        1.0    4.8
12          13  23.8   35.1       65.9    9.2
22          23  13.2   15.9       49.6    5.6
38          39  43.1   26.7       35.1   10.1
44          45  25.1   25.7       43.3    8.5
56          57   7.3   28.1       41.4    5.5
66          67  31.5   24.6        2.2    9.5

In [20]:
advertising[advertising.TV < 50 ].sort_values("Sales", ascending=False).head()

     Unnamed: 0    TV  Radio  Newspaper  Sales
135         136  48.3   47.0        8.5   11.6
148         149  38.0   40.3       11.9   10.9
134         135  36.9   38.6       65.6   10.8
190         191  39.5   41.1        5.8   10.8
1             2  44.5   39.3       45.1   10.4